nxp-mcuxpresso/mcuxsdk-examples/_boards/lpcxpresso54s018/lvgl_examples/pin_mux.c
    const uint32_t EMC_A10 = (/* Pin is configured as EMC_A(10) */
                              IOCON_PIO_FUNC6 |
                              /* No addition pin function */
                              IOCON_PIO_MODE_INACT |
                              /* Input function is not inverted */
                              IOCON_PIO_INV_DI |
                              /* Enables digital function */
                              IOCON_PIO_DIGITAL_EN |
                              /* Input filter disabled */
                              IOCON_PIO_INPFILT_OFF |
                              /* Fast mode, slew rate control is disabled */
                              IOCON_PIO_SLEW_FAST |
                              /* Open drain is disabled */
                              IOCON_PIO_OPENDRAIN_DI);
    /* PORT1 PIN16 (coords: B7) is configured as EMC_A(10) */
    IOCON_PinMuxSet(IOCON, BOARD_INITPINS_EMC_A10_PORT, BOARD_INITPINS_EMC_A10_PIN, EMC_A10);

    const uint32_t EMC_D8 = (/* Pin is configured as EMC_D(8) */
                             IOCON_PIO_FUNC6 |
                             /* No addition pin function */
                             IOCON_PIO_MODE_INACT |
                             /* Input function is not inverted */
                             IOCON_PIO_INV_DI |
                             /* Enables digital function */
                             IOCON_PIO_DIGITAL_EN |
                             /* Input filter disabled */
                             IOCON_PIO_INPFILT_OFF |
                             /* Fast mode, slew rate control is disabled */
                             IOCON_PIO_SLEW_FAST |
                             /* Open drain is disabled */
                             IOCON_PIO_OPENDRAIN_DI);
    /* PORT1 PIN19 (coords: L1) is configured as EMC_D(8) */
    IOCON_PinMuxSet(IOCON, BOARD_INITPINS_EMC_D8_PORT, BOARD_INITPINS_EMC_D8_PIN, EMC_D8);

    const uint32_t EMC_D9 = (/* Pin is configured as EMC_D(9) */
                             IOCON_PIO_FUNC6 |
                             /* No addition pin function */
                             IOCON_PIO_MODE_INACT |
                             /* Input function is not inverted */
                             IOCON_PIO_INV_DI |
                             /* Enables digital function */
                             IOCON_PIO_DIGITAL_EN |
                             /* Input filter disabled */
                             IOCON_PIO_INPFILT_OFF |
                             /* Fast mode, slew rate control is disabled */
                             IOCON_PIO_SLEW_FAST |
                             /* Open drain is disabled */
                             IOCON_PIO_OPENDRAIN_DI);
    /* PORT1 PIN20 (coords: M1) is configured as EMC_D(9) */
    IOCON_PinMuxSet(IOCON, BOARD_INITPINS_EMC_D9_PORT, BOARD_INITPINS_EMC_D9_PIN, EMC_D9);

    const uint32_t EMC_D10 = (/* Pin is configured as EMC_D(10) */
                              IOCON_PIO_FUNC6 |
                              /* No addition pin function */
                              IOCON_PIO_MODE_INACT |
                              /* Input function is not inverted */
                              IOCON_PIO_INV_DI |
                              /* Enables digital function */
                              IOCON_PIO_DIGITAL_EN |
                              /* Input filter disabled */
                              IOCON_PIO_INPFILT_OFF |
                              /* Fast mode, slew rate control is disabled */
                              IOCON_PIO_SLEW_FAST |
                              /* Open drain is disabled */
                              IOCON_PIO_OPENDRAIN_DI);
    /* PORT1 PIN21 (coords: N8) is configured as EMC_D(10) */
    IOCON_PinMuxSet(IOCON, BOARD_INITPINS_EMC_D10_PORT, BOARD_INITPINS_EMC_D10_PIN, EMC_D10);

    const uint32_t EMC_A11 = (/* Pin is configured as EMC_A(11) */
                              IOCON_PIO_FUNC6 |
                              /* No addition pin function */
                              IOCON_PIO_MODE_INACT |
                              /* Input function is not inverted */
                              IOCON_PIO_INV_DI |
                              /* Enables digital function */
                              IOCON_PIO_DIGITAL_EN |
                              /* Input filter disabled */
                              IOCON_PIO_INPFILT_OFF |
                              /* Fast mode, slew rate control is disabled */
                              IOCON_PIO_SLEW_FAST |
                              /* Open drain is disabled */
                              IOCON_PIO_OPENDRAIN_DI);
    /* PORT1 PIN23 (coords: M10) is configured as EMC_A(11) */
    IOCON_PinMuxSet(IOCON, BOARD_INITPINS_EMC_A11_PORT, BOARD_INITPINS_EMC_A11_PIN, EMC_A11);

    const uint32_t EMC_A12 = (/* Pin is configured as EMC_A(12) */
                              IOCON_PIO_FUNC6 |
                              /* No addition pin function */
                              IOCON_PIO_MODE_INACT |
                              /* Input function is not inverted */
                              IOCON_PIO_INV_DI |
                              /* Enables digital function */
                              IOCON_PIO_DIGITAL_EN |
                              /* Input filter disabled */
                              IOCON_PIO_INPFILT_OFF |
                              /* Fast mode, slew rate control is disabled */
                              IOCON_PIO_SLEW_FAST |
                              /* Open drain is disabled */
                              IOCON_PIO_OPENDRAIN_DI);
    /* PORT1 PIN24 (coords: N14) is configured as EMC_A(12) */
    IOCON_PinMuxSet(IOCON, BOARD_INITPINS_EMC_A12_PORT, BOARD_INITPINS_EMC_A12_PIN, EMC_A12);

    const uint32_t EMC_A13 = (/* Pin is configured as EMC_A(13) */
                              IOCON_PIO_FUNC6 |
                              /* No addition pin function */
                              IOCON_PIO_MODE_INACT |
                              /* Input function is not inverted */
                              IOCON_PIO_INV_DI |
                              /* Enables digital function */
                              IOCON_PIO_DIGITAL_EN |
                              /* Input filter disabled */
                              IOCON_PIO_INPFILT_OFF |
                              /* Fast mode, slew rate control is disabled */
                              IOCON_PIO_SLEW_FAST |
                              /* Open drain is disabled */
                              IOCON_PIO_OPENDRAIN_DI);
    /* PORT1 PIN25 (coords: M12) is configured as EMC_A(13) */
    IOCON_PinMuxSet(IOCON, BOARD_INITPINS_EMC_A13_PORT, BOARD_INITPINS_EMC_A13_PIN, EMC_A13);

    const uint32_t EMC_A8 = (/* Pin is configured as EMC_A(8) */
                             IOCON_PIO_FUNC6 |
                             /* No addition pin function */
                             IOCON_PIO_MODE_INACT |
                             /* Input function is not inverted */
                             IOCON_PIO_INV_DI |
                             /* Enables digital function */
                             IOCON_PIO_DIGITAL_EN |
                             /* Input filter disabled */
                             IOCON_PIO_INPFILT_OFF |
                             /* Fast mode, slew rate control is disabled */
                             IOCON_PIO_SLEW_FAST |
                             /* Open drain is disabled */
                             IOCON_PIO_OPENDRAIN_DI);
    /* PORT1 PIN26 (coords: J10) is configured as EMC_A(8) */
    IOCON_PinMuxSet(IOCON, BOARD_INITPINS_EMC_A8_PORT, BOARD_INITPINS_EMC_A8_PIN, EMC_A8);

    const uint32_t EMC_A9 = (/* Pin is configured as EMC_A(9) */
                             IOCON_PIO_FUNC6 |
                             /* No addition pin function */
                             IOCON_PIO_MODE_INACT |
                             /* Input function is not inverted */
                             IOCON_PIO_INV_DI |
                             /* Enables digital function */
                             IOCON_PIO_DIGITAL_EN |
                             /* Input filter disabled */
                             IOCON_PIO_INPFILT_OFF |
                             /* Fast mode, slew rate control is disabled */
                             IOCON_PIO_SLEW_FAST |
                             /* Open drain is disabled */
                             IOCON_PIO_OPENDRAIN_DI);
    /* PORT1 PIN27 (coords: F10) is configured as EMC_A(9) */
    IOCON_PinMuxSet(IOCON, BOARD_INITPINS_EMC_A9_PORT, BOARD_INITPINS_EMC_A9_PIN, EMC_A9);

    const uint32_t EMC_D12 = (/* Pin is configured as EMC_D(12) */
                              IOCON_PIO_FUNC6 |
                              /* No addition pin function */
                              IOCON_PIO_MODE_INACT |
                              /* Input function is not inverted */
                              IOCON_PIO_INV_DI |
                              /* Enables digital function */
                              IOCON_PIO_DIGITAL_EN |
                              /* Input filter disabled */
                              IOCON_PIO_INPFILT_OFF |
                              /* Fast mode, slew rate control is disabled */
                              IOCON_PIO_SLEW_FAST |
                              /* Open drain is disabled */
                              IOCON_PIO_OPENDRAIN_DI);
    /* PORT1 PIN28 (coords: E12) is configured as EMC_D(12) */
    IOCON_PinMuxSet(IOCON, BOARD_INITPINS_EMC_D12_PORT, BOARD_INITPINS_EMC_D12_PIN, EMC_D12);

